# More SQL with SQLite in Python

**Note:** Ensure the `sakila.db` file is in your working directory before running the notebook.

In [6]:
import sqlite3
import pandas as pd

# Set the path to the SQLite database
db_path = "sakila.db"

# Connect to SQLite database
conn = sqlite3.connect(db_path)
print("Connected to SQLite Sakila database!")

Connected to SQLite Sakila database!

### Exploring the Database Schema

Before diving into queries, it's useful to know which tables are available in the Sakila database. We'll list all tables by querying the SQLite master table.

In [9]:
# List all tables in the database
tables = pd.read_sql("""SELECT name 
                        FROM sqlite_master 
                        WHERE type='table';""", conn)

print("Tables in the database:")
print(tables)

Tables in the database:
Empty DataFrame
Columns: [name]
Index: []

## Part 1. Other Operations
These operations help you filter numeric data and handle potential NULLs. We’ll use the film table as an example:

### BETWEEN Operator
Select films where the film length is within a specified range.

In [8]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_between = """SELECT title, length
                 FROM film
                 WHERE length BETWEEN 80 AND 120;"""

# Execute the query using pd.read_sql.
df_between = pd.read_sql(query_between, conn)

print("Select films between 80 and 120 minutes:")
print(df_between)

DatabaseError: Execution failed on sql 'SELECT title, length
                 FROM film
                 WHERE length BETWEEN 80 AND 120;': no such table: film

### IS NOT NULL Operator
Ensure that you only fetch rows with actual (non-null) values.

In [ ]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_nonnull = """SELECT title, description
                FROM film
                WHERE description IS NOT NULL;"""

# Execute the query using pd.read_sql.
df_nonnull = pd.read_sql(query_nonnull, conn)

print("Drop rows without descriptions:")
print(df_nonnull)

Drop rows without descriptions:
                 title                                        description
0     ACADEMY DINOSAUR  A Epic Drama of a Feminist And a Mad Scientist...
1       ACE GOLDFINGER  A Astounding Epistle of a Database Administrat...
2     ADAPTATION HOLES  A Astounding Reflection of a Lumberjack And a ...
3     AFFAIR PREJUDICE  A Fanciful Documentary of a Frisbee And a Lumb...
4          AFRICAN EGG  A Fast-Paced Documentary of a Pastry Chef And ...
..                 ...                                                ...
995     YOUNG LANGUAGE  A Unbelieveable Yarn of a Boat And a Database ...
996         YOUTH KICK  A Touching Drama of a Teacher And a Cat who mu...
997       ZHIVAGO CORE  A Fateful Yarn of a Composer And a Man who mus...
998  ZOOLANDER FICTION  A Fateful Reflection of a Waitress And a Boat ...
999          ZORRO ARK  A Intrepid Panorama of a Mad Scientist And a B...

[1000 rows x 2 columns]

### IN Operator
Filter rows by matching a column against a list of values.

In [91]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_rating = """SELECT f.rating,f.title, COUNT(DISTINCT fa.actor_id) AS actor_count
                  FROM film AS f
                  JOIN film_actor AS fa ON f.film_id = fa.film_id
                  WHERE f.rating IN ('G', 'PG')
                  GROUP BY f.rating, f.title
                  ORDER BY f.rating DESC, f.title;"""

# Execute the query using pd.read_sql.
df_rating = pd.read_sql(query_rating, conn)

print("Query of distint count of actors per title and G and PG rated films:")
print(df_rating)

Query of distint count of actors per title and G and PG rated films:
    rating                   title  actor_count
0       PG        ACADEMY DINOSAUR           10
1       PG            AGENT TRUMAN            7
2       PG          ALASKA PHANTOM            7
3       PG             ALI FOREVER            5
4       PG            AMADEUS HOLY            6
..     ...                     ...          ...
366      G  WATERFRONT DELIVERANCE            6
367      G      WATERSHIP FRONTIER            6
368      G           WEREWOLF LOLA            7
369      G               WEST LION            9
370      G          YOUNG LANGUAGE            5

[371 rows x 3 columns]

## Part 2. Text Operations
Use the LIKE operator with wildcards to match text patterns—again, using the `film` table:

Using Wildcards with LIKE:

- `%` matches zero or more characters.
- `_` matches exactly one character.

In [20]:
query_wildcard1 = """SELECT title
                     FROM film
                     WHERE title LIKE 'A%' OR title LIKE '%s';"""

# Execute the query using pd.read_sql.
df_wc1 = pd.read_sql(query_wildcard1, conn)

print("Query films that either start with A or end with s:")
print(df_wc1)

Query films that either start with A or end with s:
                    title
0        ACADEMY DINOSAUR
1          ACE GOLDFINGER
2        ADAPTATION HOLES
3        AFFAIR PREJUDICE
4             AFRICAN EGG
..                    ...
179             WAKE JAWS
180             WON DARES
181  WONDERLAND CHRISTMAS
182   WORKING MICROCOSMOS
183    WORLD LEATHERNECKS

[184 rows x 1 columns]

In [21]:
query_wildcard2 = """SELECT title
                    FROM film
                    WHERE title LIKE '_a%'"""

# Execute the query using pd.read_sql.
df_wc2 = pd.read_sql(query_wildcard2, conn)

print("Query films where the second letter is 'a':")
print(df_wc2)

Query films where the second letter is 'a':
                      title
0                 BABY HALL
1       BACKLASH UNDEFEATED
2               BADMAN DAWN
3           BAKED CLEOPATRA
4          BALLOON HOMEWARD
..                      ...
184           WASH HEAVENLY
185        WASTELAND DIVINE
186             WATCH TRACY
187  WATERFRONT DELIVERANCE
188      WATERSHIP FRONTIER

[189 rows x 1 columns]

# Group Exercises
- Find a neighbor, yes, move around and make a new friend!
- Work through the following practice exercises together.

# Partner Practice Exercise

Now that we've seen several examples of JOINs and aggregation queries, it's time for you to practice with a partner. Complete the following tasks using the Sakila database:

1. **Challenge 1: Short Films with Language**
   - Write a query that returns each film’s title, description, and language name (labeled as “language”) from the `film` and `language` tables, for all films with length under 100. Join `film.language_id` to `language.language_id` to retrieve the language name.

2. **Challenge 2: Specific Ratings Filter with Language**
   - Write a query to display each film’s title, rating, and language name (as “language”) for all films whose rating is either ‘PG-13’ or ‘R.’ Join film.language_id to language.language_id.

3. **Challenge 3: Pattern Matching on Film Titles with Category**
   - Write a query to list each film’s title and its category name (as “category”) for all films whose title begins with “T” or ends with “s.” Join film to film_category and then to category to retrieve the category name.

4. **Challenge 4: Single-Character Wildcard with Actor Join**
   - Write a query that lists each film’s title and the actor’s full name (using first_name || ' ' || last_name) for all films whose title has “y” as the second character. Join film, film_actor, and actor on their respective IDs.

5. **Challenge 5: Distinct Customer Payments and Rentals**
   - Write a query to display each customer’s ID along with the total number of distinct payments and rentals they have made. Use LEFT JOIN with the payment and rental tables, group by the customer, and order by total payments (descending) then total rentals (descending).

6. **Challenge 6: Advanced Filtering with Category**
   - Write a query that returns each film’s title, rental rate, length, and category (labeled as “category”) for films whose rental rate is between 2.99 and 4.99, rating is either ‘PG’ or ‘R,’ and title starts with “A.” Join film to film_category and category to retrieve the category name.
         - HINT: USE `AND` as a dependent clause of your `WHERE` clause to create multiple conditions.
         
Discuss your approaches with your partner, compare your results, and be ready to review a few solutions as a class.

In [92]:
query_chal1 = """SELECT f.title, f.description, l.name AS language
                 FROM film f
                 JOIN language l ON f.language_id = l.language_id
                 WHERE f.length < 100;
              """

# Execute the query using pd.read_sql.
df_chal1 = pd.read_sql(query_chal1, conn)

print("Challenge 1")
print(df_chal1)

Challenge 1
                   title                                        description  \
0       ACADEMY DINOSAUR  A Epic Drama of a Feminist And a Mad Scientist...
1         ACE GOLDFINGER  A Astounding Epistle of a Database Administrat...
2       ADAPTATION HOLES  A Astounding Reflection of a Lumberjack And a ...
3        AIRPLANE SIERRA  A Touching Saga of a Hunter And a Butler who m...
4        AIRPORT POLLOCK  A Epic Tale of a Moose And a Girl who must Con...
..                   ...                                                ...
373        WOLVES DESIRE  A Fast-Paced Drama of a Squirrel And a Robot w...
374            WONKA SEA  A Brilliant Saga of a Boat And a Mad Scientist...
375  WORKING MICROCOSMOS  A Stunning Epistle of a Dentist And a Dog who ...
376          YENTL IDAHO  A Amazing Display of a Robot And a Astronaut w...
377            ZORRO ARK  A Intrepid Panorama of a Mad Scientist And a B...

    language
0    English
1    English
2    English
3    English
4    English
..       ...
373  English
374  English
375  English
376  English
377  English

[378 rows x 3 columns]

In [ ]:
query_chal2 = """SELECT f.title, f.rating, l.name AS language
                 FROM film f
                 JOIN language l ON f.language_id = l.language_id
                 WHERE f.rating IN ('PG-13', 'R');
              """

# Execute the query using pd.read_sql.
df_chal2 = pd.read_sql(query_chal2, conn)

print("Challenge 2")
print(df_chal2)

Challenge 3
                  title rating language
0       AIRPLANE SIERRA  PG-13  English
1       AIRPORT POLLOCK      R  English
2         ALABAMA DEVIL  PG-13  English
3            ALONE TRIP      R  English
4         ALTER VICTORY  PG-13  English
..                  ...    ...      ...
413  WORLD LEATHERNECKS  PG-13  English
414      WRONG BEHAVIOR  PG-13  English
415       WYOMING STORM  PG-13  English
416         YENTL IDAHO      R  English
417   ZOOLANDER FICTION      R  English

[418 rows x 3 columns]

In [ ]:
query_chal3 = """SELECT f.title, c.name AS category
                 FROM film f
                 JOIN film_category fc ON f.film_id = fc.film_id
                 JOIN category c ON fc.category_id = c.category_id
                 WHERE f.title LIKE 'T%' OR f.title LIKE '%s';           
              """

# Execute the query using pd.read_sql.
df_chal3 = pd.read_sql(query_chal3, conn)

print("Challenge 3")
print(df_chal3)

Challenge 4
                    title     category
0        ADAPTATION HOLES  Documentary
1     AMELIE HELLFIGHTERS        Music
2         AMERICAN CIRCUS       Action
3    ANACONDA CONFESSIONS    Animation
4        ANALYZE HOOSIERS       Horror
..                    ...          ...
181             WAKE JAWS          New
182             WON DARES        Music
183  WONDERLAND CHRISTMAS       Sci-Fi
184   WORKING MICROCOSMOS       Travel
185    WORLD LEATHERNECKS       Horror

[186 rows x 2 columns]

In [ ]:
query_chal4 = """SELECT f.title, a.first_name || ' ' || a.last_name AS actor_full_name
                 FROM film f
                 JOIN film_actor fa ON f.film_id = fa.film_id
                 JOIN actor a ON fa.actor_id = a.actor_id
                 WHERE f.title LIKE '_y%';             
              """

# Execute the query using pd.read_sql.
df_chal4 = pd.read_sql(query_chal4, conn)

print("Challenge 4")
print(df_chal4)

Challenge 5
               title    actor_full_name
0      WYOMING STORM    BETTE NICHOLSON
1   TYCOON GATHERING      VIVIEN BERGEN
2        HYDE DOCTOR       CUBA OLIVIER
3     CYCLONE FAMILY       HELEN VOIGHT
4    DYNAMITE TARZAN        BOB FAWCETT
5        HYDE DOCTOR      LUCILLE TRACY
6     CYCLONE FAMILY       RIP CRAWFORD
7      WYOMING STORM      WOODY HOFFMAN
8     CYCLONE FAMILY          JUDY DEAN
9       EYES DRIVING         DAN HARRIS
10       HYDE DOCTOR       JAYNE NEESON
11       HYDE DOCTOR         BURT POSEY
12  HYSTERICAL GRAIL         BURT POSEY
13       DYING MAKER    GROUCHO SINATRA
14     MYSTIC TRUMAN     SCARLETT DAMON
15  HYSTERICAL GRAIL   MINNIE ZELLWEGER
16   DYNAMITE TARZAN     CHARLIZE DENCH
17  HYSTERICAL GRAIL     CHARLIZE DENCH
18       HYDE DOCTOR      ELLEN PRESLEY
19  HYSTERICAL GRAIL          MEG HAWKE
20  TYCOON GATHERING       SPENCER DEPP
21  HYSTERICAL GRAIL        WALTER TORN
22     WYOMING STORM       SIDNEY CROWE
23       HYDE DOCTOR     GINA DEGENERES
24  TYCOON GATHERING  CAMERON ZELLWEGER
25     WYOMING STORM      HARRISON BALE
26      EYES DRIVING        RENEE TRACY
27     WYOMING STORM    PENELOPE MONROE
28   DYNAMITE TARZAN     JULIANNE DENCH
29  HYSTERICAL GRAIL     JULIANNE DENCH
30     MYSTIC TRUMAN      KEVIN GARLAND
31  HYSTERICAL GRAIL    MORGAN WILLIAMS
32  HYSTERICAL GRAIL        LUCILLE DEE
33   DYNAMITE TARZAN       EWAN GOODING
34     MYSTIC TRUMAN         RIVER DEAN
35      EYES DRIVING        FAY WINSLET
36  HYSTERICAL GRAIL        JAYNE NOLTE
37  TYCOON GATHERING      MINNIE KILMER
38     MYSTIC TRUMAN    HUMPHREY WILLIS
39      EYES DRIVING     MICHAEL BENING
40       DYING MAKER     MICHAEL BOLGER
41  TYCOON GATHERING     MICHAEL BOLGER
42     WYOMING STORM    JULIA ZELLWEGER
43   DYNAMITE TARZAN         CUBA BIRCH
44      EYES DRIVING  JAYNE SILVERSTONE
45  TYCOON GATHERING        BELA WALKEN

In [79]:
query_chal5 = """SELECT c.customer_id, COUNT(DISTINCT p.payment_id) AS total_payments, COUNT(DISTINCT r.rental_id)  AS total_rentals
                 FROM customer AS c
                 LEFT JOIN payment AS p ON c.customer_id = p.customer_id
                 LEFT JOIN rental AS r ON c.customer_id = r.customer_id
                 GROUP BY c.customer_id
                 ORDER BY total_payments DESC, total_rentals DESC;
              """

# Execute the query using pd.read_sql.
df_chal5 = pd.read_sql(query_chal5, conn)

print("Challenge 3")
print(df_chal5)

Challenge 2
     customer_id  total_payments  total_rentals
0            148              46             46
1            526              45             45
2            144              42             42
3            236              42             42
4             75              41             41
..           ...             ...            ...
594          248              15             15
595           61              14             14
596          110              14             14
597          281              14             14
598          318              12             12

[599 rows x 3 columns]

In [ ]:
query_chal6 = """SELECT f.title, f.rental_rate, f.length, c.name AS category
                 FROM film f
                 JOIN film_category fc ON f.film_id = fc.film_id
                 JOIN category c ON fc.category_id = c.category_id
                 WHERE f.rental_rate BETWEEN 2.99 AND 4.99
                    AND f.rating IN ('PG', 'R')
                    AND f.title LIKE 'A%';          
              """

# Execute the query using pd.read_sql.
df_chal6 = pd.read_sql(query_chal6, conn)

print("Challenge 6")
print(df_chal6)

NameError: name 'pd' is not defined

## Close the connection to the database.
Always close the connection when you're done to free up resources.

In [28]:
# Close the connection
#conn.close()